{
  "number": 1,
  "name": "সূরা আল-ফাতিহা",
  "nameArabic": "الفاتحة",
  "meaning": "উদ্বোধন",
  "revelationType": "মক্কী",
  "numberOfAyahs": 7,
  "ayahs": [
    {
      "number": 1,
      "arabic": "بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ",
      "translation": "শুরু করছি আল্লাহর নামে যিনি পরম করুণাময় ও অতি দয়ালু।"
    },
    {
      "number": 2,
      "arabic": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "translation": "সমস্ত প্রশংসা আল্লাহর জন্য, যিনি সমস্ত সৃষ্টিকুলের রব।"
    },
    {
      "number": 3,
      "arabic": "الرَّحْمَٰنِ الرَّحِيمِ",
      "translation": "যিনি পরম করুণাময় ও অতি দয়ালু।"
    },
    {
      "number": 4,
      "arabic": "مَالِكِ يَوْمِ الدِّينِ",
      "translation": "যিনি বিচার দিনের মালিক।"
    },
    {
      "number": 5,
      "arabic": "إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ",
      "translation": "আমরা শুধুমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই কাছে সাহায্য চাই।"
    },
    {
      "number": 6,
      "arabic": "اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ",
      "translation": "আমাদের সরল পথ দেখাও।"
    },
    {
      "number": 7,
      "arabic": "صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلَا الضَّالِّينَ",
      "translation": "তাদের পথ, যাদেরকে তুমি নেয়ামত দান করেছ, তাদের পথ নয় যাদের প্রতি তোমার ক্রোধ নাযিল হয়েছে এবং তারা পথভ্রষ্টও নয়।"
    }
  ]
}
